; domain
(define (domain gripper-strips)
  (:types room ball gripper)

   (:predicates (at-robby ?r - room)
		(at ?b - ball ?r - room)
		(free ?g - gripper)
		(carry ?b - ball ?g - gripper))

   (:action move
       :parameters  (?o1 ?o2 - room)
       :precondition (and (at-robby ?o1))
       :effect (and  (at-robby ?o2)
		     (not (at-robby ?o1))))



   (:action pick
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (at ?o1 ?o2) (at-robby ?o2) (free ?o3))
       :effect (and (carry ?o1 ?o3)
		    (not (at ?o1 ?o2)) 
		    (not (free ?o3))))


   (:action drop
       :parameters (?o1 - ball ?o2 - room ?o3 - gripper)
       :precondition  (and  (carry ?o1 ?o3) (at-robby ?o2))
       :effect (and (at ?o1 ?o2)
		    (free ?o3)
		    (not (carry ?o1 ?o3)))))

; problem
(define (problem strips-gripper-x-2)
  (:domain gripper-strips)
  (:objects ball6 -  ball ball7 -  ball roomb -  room rooma -  room ball5 -  ball ball4 -  ball ball3 -  ball ball2 -  ball ball1 -  ball left -  gripper right -  gripper )
  (:init (at ball7 rooma) (at ball3 rooma) (at ball4 rooma) (at ball5 rooma) (at ball1 rooma) (carry ball6 right) (at-robby roomb) (at ball2 roomb) (free left) )
  (:goal (and (at ball3 rooma)(at ball4 rooma)(at ball5 rooma)(at ball1 rooma)(at ball2 roomb)(at-robby roomb)(at ball6 roomb)(free right)(at ball7 roomb)(free left)(not (at-robby rooma))(not (at ball7 rooma))(not (at ball6 rooma))(not (at ball5 roomb))(not (at ball4 roomb))(not (at ball3 roomb))(not (at ball2 rooma))(not (at ball1 roomb))(not (carry ball7 left))(not (carry ball7 right))(not (carry ball6 left))(not (carry ball6 right))(not (carry ball5 left))(not (carry ball5 right))(not (carry ball4 left))(not (carry ball4 right))(not (carry ball3 left))(not (carry ball3 right))(not (carry ball2 left))(not (carry ball2 right))(not (carry ball1 left))(not (carry ball1 right)))))

; plan
1. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 25 of 32
2. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 24 of 32
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 26 of 32
4. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 29 of 32
5. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 32 of 32
